posts/stm/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>STM学习 | Abner Zheng's Blog</title>
<link href="../../assets/css/all.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="//fonts.googleapis.com/css?family=PT+Serif:400,400italic,700%7CPT+Sans:400">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://abnerzheng.github.io/posts/stm/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Abner Zheng">
<link rel="prev" href="../mesi-protocol/" title="MESI protocol" type="text/html">
<link rel="next" href="../charpter1/" title="Charpter 1 of 《transaction processing》" type="text/html">
<meta property="og:site_name" content="Abner Zheng's Blog">
<meta property="og:title" content="STM学习">
<meta property="og:url" content="https://abnerzheng.github.io/posts/stm/">
<meta property="og:description" content="STM是软件事务内存(software transaction memory)的简称。 我在PPCP中对它进行了一些学习，这里做个记录。







为什么我们需要STM


在多线程编程中，我们已经有了锁这种工具，那为什么我们还需要STM呢? 答案是这样的， 基于锁的程序是不可组合的.集体表现在，



即使两个各自无死锁的程序，不能保证它们的组合程序是无死锁

即使两个各自满足原子性的程序，">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-18T17:09:17+08:00">
</head>
<body class="theme-base-08">
    <a href="#content" class="sr-only sr-only-focusable">跳到主内容</a>
    <!-- Target for toggling the sidebar `.sidebar-checkbox` is for regular
            styles, `#sidebar-checkbox` for behavior. -->
    <input type="checkbox" class="sidebar-checkbox" id="sidebar-checkbox"><!-- Toggleable sidebar --><div class="sidebar" id="sidebar">
        <div class="sidebar-item">
            <p>A reserved <a href="https://getnikola.com" target="_blank">Nikola</a> theme that places the utmost gravity on content with a hidden drawer. Made by <a href="https://twitter.com/mdo" target="_blank">@mdo</a> for Jekyll,
            ported to Nikola by <a href="https://twitter.com/ralsina" target="_blank">@ralsina</a>.</p>
        </div>
        
    <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../archive.html">文章存档</a>
        <a class="sidebar-nav-item" href="../../categories/">标签</a>
        <a class="sidebar-nav-item" href="../../rss.xml">RSS 源</a>
    
    
    </nav>
</div>

    <!-- Wrap is the content to shift when toggling the sidebar. We wrap the
         content to avoid any CSS collisions with our real content. -->
    <div class="wrap">
      <div class="masthead">
        <div class="container">
          
    <h3 id="brand" class="masthead-title">
      <a href="https://abnerzheng.github.io/" title="Abner Zheng's Blog" rel="home">Abner Zheng's Blog</a>
    </h3>

        </div>
      </div>

      <div class="container content" id="content">
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="post-title p-name entry-title" itemprop="headline name"><a href="." class="u-url">STM学习</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">Abner Zheng</span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="post-date published dt-published" datetime="2017-07-18T17:09:17+08:00" itemprop="datePublished" title="2017-07-18 17:09">2017-07-18 17:09</time></a></p>
                <p class="commentline">
        


        </p>
</div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
STM是软件事务内存(software transaction memory)的简称。 我在PPCP中对它进行了一些学习，这里做个记录。
</p>

<!--TEASER_END-->



<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">为什么我们需要STM</h2>
<div class="outline-text-2" id="text-1">
<p>
在多线程编程中，我们已经有了锁这种工具，那为什么我们还需要STM呢? 答案是这样的， 基于锁的程序是不可组合的.集体表现在，
</p>

<ul class="org-ul">
<li>即使两个各自无死锁的程序，不能保证它们的组合程序是无死锁
</li>
<li>即使两个各自满足原子性的程序，不能保证他们的组合程序满足原子性
</li>
</ul>
<p>
这个特性使得基于锁的编程难度骤升。而STM能够很好得解决这个问题。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">STM的优点</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>事务是可以组合的
</li>
<li>容易支持阻塞
</li>
<li>通常是乐观的，读并行自动具有可扩展性
</li>
<li>没有死锁问题
</li>
</ul>
<p>
与Database中的事务不同的是，STM不需要具有Durable性质，只需要有ACI性质。
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">STM库</h2>
<div class="outline-text-2" id="text-3">
<p>
在Java中并没有原生实现STM，但是我们可以使用Multiverse库, 它的最新版本是2012年四月发布的0.7版本.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../mesi-protocol/" rel="prev" title="MESI protocol">前一篇</a>
            </li>
            <li class="next">
                <a href="../charpter1/" rel="next" title="Charpter 1 of 《transaction processing》">后一篇</a>
            </li>
        </ul></nav></aside><section class="comments hidden-print"><h2>注释</h2>
        
        


        </section></article><footer id="footer"><p>Contents © 2018         <a href="mailto:abnerzheng@gmail.com">Abner Zheng</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("zh-cn");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
